Contents:
1. Import Necessary Libraries
2. Read in and Explore the Data
3. Data Analysis
4. Data Visualization
5. Cleaning Data
6. Choosing the Best Model

1) Import Necessary Libraries

In [1]:
# data analysis libraries
import numpy as np
import pandas as pd

#visualization libraries
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

#ignore warnings
import warnings
warnings.filterwarnings('ignore')

import os 
print("PACKAGES IS LOADED")

PACKAGES IS LOADED

2) Read in and Explore the Data

In [2]:
os.chdir(r"C:\Users\heon1\Desktop\DATA\titanic")
cwd = os.getcwd()
print(cwd)

C:\Users\heon1\Desktop\DATA\titanic

In [3]:
train = pd.read_csv(cwd+r"\train.csv", encoding= "UTF-8", index_col= 0)
test = pd.read_csv(cwd+r"\test.csv", encoding="UTF-8", index_col = 0)
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

3) Data Analysis

In [4]:
print(train.columns)
print(train.shape)

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')
(891, 11)

In [5]:
train.sample(5)
# Numberical : Age, Fare, SibSp, Parch
# Categorical : Survived, Sex, Embarked, Pclass
# Alphaunumerical: Ticket, Cabin

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5000,B77,S
468,0,1,"Smart, Mr. John Montgomery",male,56.0,0,0,113792,26.5500,NaN,S
425,0,3,"Rosblom, Mr. Viktor Richard",male,18.0,1,1,370129,20.2125,NaN,S
778,1,3,"Emanuel, Miss. Virginia Ethel",female,5.0,0,0,364516,12.4750,NaN,S
383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S

In [6]:
train.describe(include = 'all')
# Observation
# Total 891 passengers
# Age column is missing approximately 19.% of its values. However, age column seem important so i should probably fill the gaps 
# Cabin feature is missing approximately 77.1% of its values. Too much data is missing so i should drop the column itself
# Embarked column is missing 0.22% of its values. It is very minimal so it won't matter

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,"Danoff, Mr. Yoto",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [7]:
# NA Check
print(pd.isnull(train).sum()) #train_df.isna().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [8]:
print(test.isna().sum()) # del name, ticket, cabin 
# interpolate age, fare, embarked
# sex to dummy
# sissp + parch = family num
#

Pclass        0
Name          0
Sex           0
Age          86
SibSp         0
Parch         0
Ticket        0
Fare          1
Cabin       327
Embarked      0
dtype: int64

In [9]:
print(train.loc[1:5, "Ticket"])

PassengerId
1           A/5 21171
2            PC 17599
3    STON/O2. 3101282
4              113803
5              373450
Name: Ticket, dtype: object

In [10]:
# types check
train.dtypes

# del name, ticket, cabin 
# interpolate age, fare, embarked
# sex to dummy
# sissp + parch = family num
#

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

# CLEANING DATA

In [11]:
# DELETE NAME TICKET, CABIN
del_columns = ['Name', 'Ticket', 'Cabin']
train.drop(del_columns, axis=1, inplace =True)
test.drop(del_columns, axis=1, inplace = True)
print("columns is %s" %train.columns)

columns is Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [12]:
train['Age'].fillna(value = train['Age'].mean(), inplace=True)
print(train.isna().sum())

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [13]:
print(pd.get_dummies(train['Embarked']).sum()) # so i will choose 'S'
train['Embarked'].fillna(value = 'S', inplace= True)
print("TRAIN NA SUM IS %s" %train.isna().sum().sum())

C    168
Q     77
S    644
dtype: int64
TRAIN NA SUM IS 0

In [14]:
test['Age'].fillna(value = test['Age'].mean(), inplace =True)
test['Fare'].fillna(value = test['Fare'].mean(), inplace = True)
test.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [15]:
pcl = pd.get_dummies(train['Pclass'], drop_first=True)
sex = pd.get_dummies(train['Sex'], drop_first=True)
emb = pd.get_dummies(train['Embarked'], drop_first=True)

In [16]:
train2 =pd.concat([train, pcl, sex, emb], axis=1)
train2.columns
del_columns2 = ['Pclass', 'Sex', 'Embarked']
train2.drop(del_columns2, axis=1, inplace= True)

In [17]:
y_train = train2['Survived']
y_train
train2.drop(['Survived'], axis=1, inplace =True)

In [18]:
pcl2 = pd.get_dummies(test['Pclass'], drop_first=True)
sex2 = pd.get_dummies(test['Sex'], drop_first=True)
emb2 = pd.get_dummies(test['Embarked'], drop_first=True)
test2 = pd.concat([test, pcl2, sex2, emb2], axis=1)
test2.drop(del_columns2, axis=1, inplace = True)
test2.shape
train.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.002015    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   29.699118    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [19]:
# age, fare 정규화
train2['Age'] = (train2['Age']- train2['Age'].mean())/train2['Age'].std()
#train2['Age'].Describe()
#pd.DataFrame.describe(train2['Age'])
train2['Fare'] = (train2['Fare'] - train2['Fare'].mean())/train2['Fare'].std()
train2.columns
train2.isna().sum()
train2.dtypes

test2['Age'] = (test['Age'] - test['Age'].mean())/test['Age'].std()
est2['Fare'] = (test['Fare'] - test['Fare'].mean())/ test['Fare'].std()

print(train2.shape, test2.shape)
print("train columns : %s \ntest columns: %s" %(train2.columns , test2.columns))

(891, 9) (418, 9)
train columns : Index(['Age', 'SibSp', 'Parch', 'Fare', 2, 3, 'male', 'Q', 'S'], dtype='object')
test columns: Index(['Age', 'SibSp', 'Parch', 'Fare', 2, 3, 'male', 'Q', 'S'], dtype='object')

In [25]:
y_train.shape
train2.shape

(891, 9)

In [26]:

from sklearn.model_selection import GridSearchCV
from sklearn.svm import SVC
from sklearn.ensemble import AdaBoostClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report
from sklearn import preprocessing
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import roc_auc_score

In [27]:
test_tmp = pd.read_csv(cwd + r"\gender_submission.csv")

In [28]:
y_test = test_tmp['Survived']
y_test

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Survived, Length: 418, dtype: int64

In [29]:
a = []
b = []
c = [0.1, 1, 10]
for i in c:
    log = LogisticRegression(C= i)
    log.fit(train2, y_train)
    a +=[accuracy_score(log.predict(train2), y_train)]
    b +=[accuracy_score(log.predict(test2), y_test)]

In [30]:
print(a)
print(b)

[0.8114478114478114, 0.8047138047138047, 0.8047138047138047]
[0.9401913875598086, 0.9521531100478469, 0.9449760765550239]

In [ ]:
log1 = LogisticRegression(C=1)
log1.fit(train2, y_train)
accuracy_score(log1.predict(train2), y_train)
accuracy_score(log1.predict(test2), y_test)
confusion_matrix(log1.predict(test2), y_test)
print(classification_report(log1.predict(test2), y_test))

In [ ]:
roc_auc_score(log1.predict(test2), y_test)

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
neigh = KNeighborsClassifier(n_neighbors=3)
neigh.fit(X, y) 


print(neigh.predict([[1.1]]))

print(neigh.predict_proba([[0.9]]))
[[0.66666667 0.33333333]]

In [ ]:
d= []
e = []
f = [3,5,7,2]
for i in f:
    neigh = KNeighborsClassifier(n_neighbors=i)
    neigh.fit(train2, y_train) 
    d +=[accuracy_score(neigh.predict(train2), y_train)]
    e +=[accuracy_score(neigh.predict(test2), y_test)]

In [ ]:
print(d)
print(e)

In [32]:
from sklearn.tree import DecisionTreeClassifier

In [ ]:
# Decision Tree
a = []
b = []
c = [0.1, 1, 10]
for i in c:
    tree = DecisionTreeClassifier(max_iter = , )
    tree.fit(train2, y_train)
    log.fit(train2, y_train)
    a +=[accuracy_score(log.predict(train2), y_train)]
    b +=[accuracy_score(log.predict(test2), y_test)]

In [ ]:
# SVC
a = []
b = []
c = [0.1, 1, 10]
for i in c:
    clf = SVC(kernel =  )
    tree.fit(train2, y_train)
    log.fit(train2, y_train)
    a +=[accuracy_score(log.predict(train2), y_train)]
    b +=[accuracy_score(log.predict(test2), y_test)]